examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_030/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          14;
        startFace       44488;
    }
    inlet_1
    {
        type            patch;
        nFaces          14;
        startFace       44502;
    }
    inlet_2
    {
        type            patch;
        nFaces          14;
        startFace       44516;
    }
    inlet_3
    {
        type            patch;
        nFaces          14;
        startFace       44530;
    }
    inlet_4
    {
        type            patch;
        nFaces          14;
        startFace       44544;
    }
    inlet_5
    {
        type            patch;
        nFaces          14;
        startFace       44558;
    }
    inlet_6
    {
        type            patch;
        nFaces          14;
        startFace       44572;
    }
    inlet_7
    {
        type            patch;
        nFaces          14;
        startFace       44586;
    }
    outlet
    {
        type            patch;
        nFaces          112;
        startFace       44600;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       44712;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       44712;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          44800;
        startFace       45112;
    }
)

// ************************************************************************* //
